## Exercise 4 - SQLite

1 Add the necessary libraries for SQLite3 and make a database named `test.db`.

In [7]:
import sqlite3

db_connection = sqlite3.connect('test.db')

2 Create a connection to the database.

In [8]:
c = db_connection.cursor()

3 Make the following table in the database, named `people`:
    
| name | age | shoe_size |
| ------------- |-------------| -----|
| Prank | 88 | 47 |
| Matt | 34 | 39 |
| Ilona | 41 | 36 |
| Sonja | 32 | 37 |

In [9]:
# Create a table called 'people' with 'name', 'age', and 'show_size' columns
c.execute("""
          CREATE TABLE 
            IF NOT EXISTS 
          people(name, age, shoe_size)
         """)

# sample values for the people table
sample_sqlite_data_rows = [('Prank', 88, 47), ('Matt', 34, 39), ('Ilona', 41, 36), ('Sonja', 32, 37)]

# insert rows in people table based on sample_data
for data_row in sample_sqlite_data_rows:
    c.execute(f"""
              INSERT INTO people VALUES 
                {data_row}
             """)

# Saving the changes
db_connection.commit()

# Retrieving all data in the original format
data = c.execute('''SELECT * FROM people''')
retrieved_data = data.fetchall()

retrieved_data

[('Prank', 88, 47), ('Matt', 34, 39), ('Ilona', 41, 36), ('Sonja', 32, 37)]

4 When the Table has been created, convert the table to the Pandas DataFrame object and add the column `hat_size' to it, then fill that column with the values ​​you choose.

In [10]:
import pandas as pd

df = pd.read_sql("SELECT * FROM people", db_connection)
df['hat_size'] = [12, 13, 14, 16]

df

    name  age  shoe_size  hat_size
0  Prank   88         47        12
1   Matt   34         39        13
2  Ilona   41         36        14
3  Sonja   32         37        16

5 Make a copy of the DataFrame object with the name `person_table_copy` and add a row to it with the values ​you choose. Now save this modified dataframe object in the database as `person_table_copy` (will be created next to the previous table).

In [11]:
person_table_copy = df.copy()

# Add a row at the end of an existing dataframe
# df.loc[len(df.index)] = ['Bart', 12, 35, 31]

# Create two dataframes, with one containing the data to append to the original, and concat them
data_to_append = pd.DataFrame({'name': ['Bart'], 'age': [12], 'shoe_size': [35], 'hat_size': [31]})

person_table_copy = pd.concat([person_table_copy, data_to_append])

# Save the merged dataframe to the database as a new table
person_table_copy.to_sql(name='person_table_copy', con=db_connection, if_exists='fail', index=False)

# Confirm that table was created
result = c.execute("SELECT * FROM person_table_copy")
result.fetchall()

[('Prank', 88, 47, 12),
 ('Matt', 34, 39, 13),
 ('Ilona', 41, 36, 14),
 ('Sonja', 32, 37, 16),
 ('Bart', 12, 35, 31)]

6 Finally, save the database changes and close the connection.

In [12]:
# Save the changes
db_connection.commit()

# Close the connect
db_connection.close()